# 당신은 음식점의 계산을 도와주는 점원. 카운터에는 거스름돈으로 사용할 500원, 100원, 50원, 10원짜리 동전이
# 무한히 존재한다고 가정. 손님에게 거슬러 주어야 할 돈이
# N원일 때 거슬러 주어야 할 동전의 최소 개수 찾기
# 단 거슬러 줘야 할 돈 N은 항상 10의 배수
def solution(N):
    # N이 거슬러 주어야할 돈
    # 500원, 100원, 50원, 10원
    # 5100 /500 몫 10 나머지 100  
    # 100 / 100 몫 1 나머지 0
    count = 0
    while (N > 0):
        if (N >= 500):
            count += N // 500
            N = N % 500
        elif (N >= 100):
            count += N // 100
            N = N % 100
        elif (N >= 50):
            count += N // 50
            N = N % 50
        else:
            count += N // 10
            N = N % 10          

    return count
print(solution(5100))